export default defineI18nConfig(() => ({
    legacy: false,
    locale: 'kr',
    messages: {
   // Header
   kr: {
    // Home page start
    catalog: "Каталог",
    company_about: " Кампания ҳақида",
    blog: "Блог",
    calculyator: "Калькулятор",
    contact: "Контактлар",

    // Hero
    heroH1: "Ҳар қандай шароитда металларни биз билан осон топасиз",
    heroP:
      "Металларни сиз хоҳлаган миқдорда ва сиз хоҳлаган сифатда етказиб бера оламиз",

    HeroButton: "Маҳсулотларни кўриш",
    HeroButtonContact: "Контакт",

    //  ProductTop
    ProductTopH0: "ТОП маҳсулотлар",
    ProductTopth1: "Темир Маҳсулот Тури",
    ProductTopth2: "Категорияси",
    ProductTopth3: "Узунлиги",
    ProductTopth4: "Қалинлиги",
    ProductTopth5: "Сотув Нархи(1м)",

    // Catalog
    CatalogH2: "Каталог",
    SpanDvuxtavr: "Двухтавр",
    SpanShveller: "Швеллер",
    SpanUgalok: "Угалок",
    SpanTruba: "Труба",
    SpanList: "Лист",
    SpanArmatura: "Арматура",
    SpanKvadratprofil: "Квадрат профил",
    SpanKvadratprut: "Квадрат прут",
    SpanPrut: "Прут",
    SpanMetallpalasa: "Металл паласа",
    SpanMetallplanka: "Металл планка",
    SpanKataloggaotish: "Каталогга ўтиш",

    // WeAbout
    PAboutWe:
    "'BIG METALL' 2005 йилида Рустамжон Қадиров томонидан асос солинган. Компания бошланғич  йилларда сифарли металларни сотиш ва қайта ишлаш билан шугулланиб, кейинги даврда фаолиятини кенгайтириб, металл маҳсулотларини сотиш ва ишлаб чиқариш соҳасида ҳамкорликни ривожлантиришга интилган. Ушбу компания, сифатли металл материалларини олиб сотишда ва уларни қайта ишлашда кенг қамровли ва технологик жараёнлардан фойдаланади. Бу жараёнлар ўз ичига сифатни ошириш, қулайликларни таъминлаш ва мижозларга кўрсатиладиган хизмат сифатини юқори даражада сақлашни мақсад қилади. 'Big Metall' компанияси оммавий фаолиятида металл маҳсулотларининг сотиш ва ишлаб чиқариш соҳасида кенгайтирилган тажрибага эга. Улар сифатли маҳсулотларни таклиф этиш ва мижозлар билан ишончли ҳамкорликда ишлашни мақсад қилганлар. Хавфсизлик ва маданиятли ишлаб чиқариш бўйича ҳамкорлик компания учун муҳимдир ва улар ушбу муаммоларга еътибор берадилар. Компания ўз фаолиятларида сифатни ошириш, янгиликлардан фойдаланиш, ва технологик ривожланишга интилади. Бу орқали, 'Big Metall' металл маҳсулотларининг сотиш ва ишлаб чиқариш соҳасида муваффақиятли фаолиятни давом эттиришни режалайди.",
    H2AboutWe: "Биз ҳақимизда",

    //  Pixabay
    PixabayH2:
      "Маҳсулотларни исталган вақтда қулай нархда “BIG METALL“ дан топинг",
    PixabayP: "тоннагача бепул етказиб бериш",

    // Partner
    PartnerH6: "Биз ишлаган ташкилотлар",
    PartnerH3: "Бу компаниялар бизга ишонишади",
    PartnerP:
      "Ушбу ташкилотлар билан 10 йилдан ортиқ вақт давомида бирга ўз фаолиятимизни юритиб келмоқдамиз, ҳамкорларимизнинг ишончи фаолиятимизда энг муҳим таянч.",

    // Contact
    ContactH1: "Манзил",
    ContactP:
      "Тошкент шаҳри, Ориентир: Бывший завод Ширибом, Промзона, Khasanboy 111112, Узбекистан",
    ContactButton: "Харитадан кўриш",
    ContactH: "Боғланиш учун :",
    Contactlabel1: "Исмингиз",
    Contactlabel2: "Телефон рақам",
    Contactlabel3: "Маълумот",
    ContactTextarea: "Менга металл лист маҳсулотлари керак",
    ContactButton2: "Юбориш",

    // Footer
    Footercatalog: "Каталог",
    Footerabout: "Компания ҳақида",
    Footerblog: "Блог",
    Footercalculyator: "Калькулятор",
    Footercontact: "Контактлар",
    FooterH5: "Боғланиш учун :",
    FooterButton: "Харитадан кўриш",
    FooterH6: "Манзил : Бывший завод Ширибом, Промзона, Khasanboy",
    FooterH7: "Барча ҳуқуқлар ҳимояланган. “BIG METALL” 2023",
    FooterBuuton2: "Харитадан кўриш",
    // Home page end

    // About Company start

    companyH1:
      "Биз, сизнинг хоҳишларингизга мос келадиган сифат ва миқдордаги металларни кўрсатиш мумкин. ",
    companyH3:
      "Big Metall компанияси сифатли металл материалларини олиб сотиб, уларни ўз ичига олган технологиялар ва жараёнлар орқали қайта ишлаш билан шугъулланади. Бу шу билан бирга, улар харажатларни камайтириш, маҳсулотни сотишни ошириш ва мижозларига юқори сифатли маҳсулотлар таклиф этишни мақсад қилади",
    companyP:
      "Бизнинг мақсадимиз мижозлар ишончини қозониш ва уларга сифатли маҳсулот етказиб бериш.",
      companyH51: " т",
      companyH52: " т",
      companyH53: " т",
      companyP1: "Йиллик маҳсулот айланмаси",
      companyP2: "Кунлик маҳсулот айланмаси",
      companyP3: "Ҳозирда сотувда мавжуд",

    companyAboutH2: "Биз ҳақимизда",
    companyAboutP1:
      "'BIG METALL' 2005 йилида Рустамжон Қадиров томонидан асос солинган. Компания бошланғич  йилларда сифарли металларни сотиш ва қайта ишлаш билан шугулланиб, кейинги даврда фаолиятини кенгайтириб, металл маҳсулотларини сотиш ва ишлаб чиқариш соҳасида ҳамкорликни ривожлантиришга интилган. Ушбу компания, сифатли металл материалларини олиб сотишда ва уларни қайта ишлашда кенг қамровли ва технологик жараёнлардан фойдаланади. Бу жараёнлар ўз ичига сифатни ошириш, қулайликларни таъминлаш ва мижозларга кўрсатиладиган хизмат сифатини юқори даражада сақлашни мақсад қилади. 'Big Metall' компанияси оммавий фаолиятида металл маҳсулотларининг сотиш ва ишлаб чиқариш соҳасида кенгайтирилган тажрибага эга. Улар сифатли маҳсулотларни таклиф этиш ва мижозлар билан ишончли ҳамкорликда ишлашни мақсад қилганлар. Хавфсизлик ва маданиятли ишлаб чиқариш бўйича ҳамкорлик компания учун муҳимдир ва улар ушбу муаммоларга еътибор берадилар. Компания ўз фаолиятларида сифатни ошириш, янгиликлардан фойдаланиш, ва технологик ривожланишга интилади. Бу орқали, 'Big Metall' металл маҳсулотларининг сотиш ва ишлаб чиқариш соҳасида муваффақиятли фаолиятни давом эттиришни режалайди.",

    TargetH41: "СТРАТEГИЯ",
    TargetH42: "МАҚСАД",
    TargetH43: "МИССИЯ",
    TargetH51: "Бизнинг стратегия",
    TargetH52: "Бизнинг максад",
    TargetH53: "Бизнинг миссия",
    TargetP1:
    "Бизнинг миссиямиз – мижозларимизнинг талабларига жавоб бериш учун сифатли металлургия ҳoллари ва материаллари таклиф қилиш, ишончлилик, истиқлол ва истиқболли технологияларни ишлатиш билан ишлаб чиқариш жараёнларида.",
    TargetP2:
    "Мижозларга қўллаб-қувватлаш: Мижозларимиз учун танланган ёки таҳдидий хизматлар ҳақидаги тез-тез мавзуларнинг ўтказишини бажариш, уларнинг талабларига жавоб берадиган индивидуал ҳoлларни таклиф қилиш.",
    TargetP3:
      "Инновация ва ривожлантириш: Янги металлургия ҳoллари ва маҳсулотларни яратиш учун тадқиқотлар ва ривожланишларга инвестиция қилиш. Эълон қилинган ишловчи процесслар, энвиронментга ташҳирланадиган таъсирни камайтириш ва экология стандартларига мувофиқлик.",
 
    // About Company end

    // Blog start
    BlogButton: "Батафсил",
    BlogSpan: 'Блоглар тез орада қўшилади',
    // Blog end

    // Contact start
    ContactPageH3: "Контакт",
    ContactPageP:
      "Бизга исталган вақтда хабар қолдиринг. Операторларимиз сиз билан тез орада боғланишади",
    ContactPageInput: "Исмингиз",
    ContactPageInput2: "Телефон рақамингиз",
    ContactPageInput3: "Хабар",
    ContactPageButton: "Юбориш",
    ConatctPageH4: "Инфо",
    ContactPageH6: "Хасанбой т: Бывший завод Ширибом, Промзона",

    // Contact end
    //Catalog id 
    catalogoption: 'Ҳамма Маҳсулотлар',
    //Calculyator
    CalcH2: "Калькулятор",
    //Basket 
    BasketH1: 'Корзинка',
    BasketButton: 'Барчасини ўчириш',
    BasketP1: 'сўм',
    BasketSpanDiv: 'сўм',
    BasketSpan1: 'сўм',
    BasketSpan2: 'Умумий нарх :',
    BasketSpanA: 'Буюртмани расмийлаштириш', 
    BasketDivA: 'Mаҳсулот мавжуд эмас',

    //Basket Submit
    BasketInput1: 'Тўлиқ исмни киритинг',
    BasketInput2: '+998( )',
    BasketButton2: 'Юбориш',

    BasketDivSpan: 'Маҳсулот мавжуд эмас',
      //Calc input select 
          //dvuxtavr
        CalcInput1: 'Категориясини тангланг',
        CalcInput2: 'Турини Тангланг',
        CalcInput3: '1м даги оғирлиги (кг)',
        CalcInput4: '1тоннадаги узунлиги (м)',
        CalcInput5: 'Узунликни киритинг',
        CalcInput6: 'Умумий ўгирлиги',

        //armatura
        CalcInput7: 'Категориясини киритинг(сонда)',
        CalcInput8: '1м даги оғирлиги (кг)',
        CalcInput9: '1тоннадаги узунлиги (м)',
        CalcInput10: 'Узунликни киритинг',
        CalcInput11: 'Умумий ўгирлиги',

        //ugalok
        CalcInput12: 'Категориясини тангланг',
        CalcInput13: 'Турини Тангланг',
        CalcInput14: '1м даги оғирлиги (кг)',
        CalcInput15: '1тоннадаги узунлиги (м)',
        CalcInput16: 'Узунликни киритинг',
        CalcInput17: 'Умумий ўгирлиги',

            //shveller
            CalcInput18: 'Категориясини киритинг(сонда)',
            CalcInput19: '1м даги оғирлиги (кг)',
            CalcInput20: '1тоннадаги узунлиги (м)',
            CalcInput21: 'Узунликни киритинг',
            CalcInput22: 'Умумий ўгирлиги',

            // труба 
            CalcInput23: 'Ташқи диаметрини тангланг',
            CalcInput24: 'Деворнинг Қалинлгини Тангланг',
            CalcInput25: '1м даги оғирлиги (кг)',
            CalcInput26: '1тоннадаги узунлиги (м)',
            CalcInput27: 'Узунликни киритинг',
            CalcInput28: 'Умумий ўгирлиги',

            // list 
            CalcInput29: 'Категориясини киритинг(сонда)',
            CalcInput30: 'даги оғирлиги (кг)',
            CalcInput31: '1тоннадаги узунлиги',
            CalcInput32: 'Узунликни киритинг',
            CalcInput33: 'Умумий ўгирлиги',

                // квадрат профил 
                CalcInput34: 'Категориясини тангланг',
                CalcInput35: 'Турини тангланг',
                CalcInput36: '1м даги оғирлиги (кг)',
                CalcInput37: '1тоннадаги узунлиги (м)',
                CalcInput38: 'Узунликни киритинг',
                CalcInput39: 'Умумий ўгирлиги',

                    //квадрат прут
                    CalcInput40: 'Категориясини киритинг(сонда)',
                    CalcInput41: '1м даги оғирлиги (кг)',
                    CalcInput42: '1тоннадаги узунлиги (м)',
                    CalcInput43: 'Узунликни киритинг',
                    CalcInput44: 'Умумий ўгирлиги',

                       //прут
                       CalcInput45: 'Категориясини киритинг(сонда)',
                       CalcInput46: '1м даги оғирлиги (кг)',
                       CalcInput47: '1тоннадаги узунлиги (м)',
                       CalcInput48: 'Узунликни киритинг',
                       CalcInput49: 'Умумий ўгирлиги',

                       //  металл паласа
                  CalcInput50: 'Категориясини киритинг(сонда)',
                  CalcInput51: 'даги оғирлиги (кг)',
                  CalcInput52: '1тоннадаги узунлиги',
                  CalcInput53: 'Узунликни киритинг',
                  CalcInput54: 'Умумий ўгирлиги',

                  //  металл планка
                  CalcInput55: 'Категориясини киритинг(сонда)',
                  CalcInput56: 'даги оғирлиги (кг)',
                  CalcInput57: '1тоннадаги узунлиги',
                  CalcInput58: 'Узунликни киритинг',
                  CalcInput59: 'Умумий ўгирлиги',


              
  },

  ru: {
    // Home page start
    // Header
    catalog: "Каталог",
    company_about: "Кампании",
    blog: "Блог",
    calculyator: "Калькулятор",
    contact: "Контакты",

    // Hero
    heroH1: "У нас вы легко найдете металлы в любой ситуации",
    heroP:
      "Мы можем поставить металлы в нужном вам количестве и желаемом качестве.",

    HeroButton: "Посмотреть продукты",
    HeroButtonContact: "Контакт",

    //  ProductTop
    ProductTopH0: "ТОП продукты",
    ProductTopth1: "Тип железного продукта",
    ProductTopth2: "Категория",
    ProductTopth3: "Длина",
    ProductTopth4: "Толщина",
    ProductTopth5: "Цена продажи (1м)",

    // Catalog
    CatalogH2: "Каталог",
    SpanDvuxtavr: "Двухтавр",
    SpanShveller: "Швеллер",
    SpanUgalok: "Угалок",
    SpanTruba: "Труба",
    SpanList: "Лист",
    SpanArmatura: "Арматура",
    SpanKvadratprofil: "Квадрат профил",
    SpanKvadratprut: "Квадрат прут",
    SpanPrut: "Прут",
    SpanMetallpalasa: "Металлическая паласа",
    SpanMetallplanka: "Металлическая пластина",
    SpanKataloggaotish: "Перейти в каталог",

    // WeAbout
    PAboutWe:
      "«БИГ МЕТАЛЛ» был основан в 2005 году Рустамжоном Кадыровым. В первые годы компания занималась продажей и обработкой цветных металлов, позже расширила свою деятельность и стремилась развивать сотрудничество в сфере продажи и производства металлопродукции. Эта компания использует обширные и технологические процессы при импорте и обработке качественных металлических материалов. Эти процессы направлены на повышение качества, обеспечение удобства и поддержание высокого уровня обслуживания клиентов. Компания «Биг Металл» имеет большой опыт работы в сфере продажи и производства металлопродукции. Они стремятся предлагать качественную продукцию и работать в доверительном партнерстве с клиентами. Для компании важно сотрудничество в области безопасности и цивилизованного производства, и они уделяют этим вопросам внимание. Компания стремится повышать качество, использовать инновации и технологические разработки в своей деятельности. Благодаря этому «Большой металл» планирует продолжить успешную деятельность в сфере реализации и производства металлопродукции.",
    H2AboutWe: "О нас",

    //  Pixabay
    PixabayH2:
      "Найдите товары в «БИГ МЕТАЛЛ» по доступным ценам в любое время.",
    PixabayP: "бесплатная доставка до тонны",

    // Partner
    PartnerH6: "Организации, с которыми мы работали",
    PartnerH3: "Эти компании доверяют нам",
    PartnerP:
      "Мы сотрудничаем с этими организациями уже более 10 лет, доверие наших партнеров – важнейшая поддержка в нашей работе.",
    // Contact
    ContactH1: "Адрес",
    ContactP:
      "г. Ташкент, Ориентир: Бывший завод Ширибом, Промзона, Хасанбой 111112, Узбекистан",
    ContactButton: "Посмотреть с карты",
    ContactH: "Связаться :",
    Contactlabel1: "Ваше имя",
    Contactlabel2: "Номер телефона",
    Contactlabel3: "Информация",
    ContactTextarea: "Мне нужны изделия из листового металла",
    ContactButton2: "Отправка",

    // Footer
    Footercatalog: "Каталог",
    Footerabout: "О компании",
    Footerblog: "Блог",
    Footercalculyator: "Калькулятор",
    Footercontact: "Контакты",
    FooterH5: "Связаться :",
    FooterButton: "Посмотреть с карты",
    FooterH6: "Адрес: Бывший завод Ширибом, Промзона, Хасанбой.",
    FooterH7: "Все права защищены. «БИГ МЕТАЛЛ» 2023",
    FooterBuuton2: "Посмотреть с карты",
    // Home page end

    // About Company start
    companyH1: "Мы можем предоставить вам то качество и количество металла, которое соответствует вашим потребностям.",
    companyH3:
      "Компания Big Metall покупает и продает качественные металлические материалы и обрабатывает их, используя соответствующие технологии и процессы. В то же время они стремятся снизить затраты, увеличить продажи продукции и предложить своим клиентам высококачественную продукцию.",
    companyP:
      "Наша цель – завоевать доверие наших клиентов и предоставить им качественную продукцию.",
      companyH51: " т",
      companyH52: "10т",
      companyH53: " т",
    companyP1: "Тонны продукции перерабатываются в год",
    companyP2: "Оборот продукции",
    companyP3: "Тираж по состоянию на день",

    companyAboutH2: "О нас",
    companyAboutP1:
    "«БИГ МЕТАЛЛ» был основан в 2005 году Рустамжоном Кадыровым. В первые годы компания занималась продажей и обработкой цветных металлов, позже расширила свою деятельность и стремилась развивать сотрудничество в сфере продажи и производства металлопродукции. Эта компания использует обширные и технологические процессы при импорте и обработке качественных металлических материалов. Эти процессы направлены на повышение качества, обеспечение удобства и поддержание высокого уровня обслуживания клиентов. Компания «Биг Металл» имеет большой опыт работы в сфере продажи и производства металлопродукции. Они стремятся предлагать качественную продукцию и работать в доверительном партнерстве с клиентами. Для компании важно сотрудничество в области безопасности и цивилизованного производства, и они уделяют этим вопросам внимание. Компания стремится повышать качество, использовать инновации и технологические разработки в своей деятельности. Благодаря этому «Большой металл» планирует продолжить успешную деятельность в сфере реализации и производства металлопродукции.",

    TargetH41: "СТРАТЕГИЯ",
    TargetH42: "ЦЕЛЬ",
    TargetH43: "МИССИЯ",
    TargetH51: "Наша стратегия",
    TargetH52: "Наша цель",
    TargetH53: "Наша миссия",
    TargetP1:
      "Наша миссия — предлагать качественные металлургические корпуса и материалы, отвечающие требованиям наших клиентов, используя надежные, независимые и перспективные технологии в производственных процессах.",
    TargetP2:
      "Поддержка клиентов: для обработки частых тем об избранных или угрожающих услугах для наших клиентов, предлагая индивидуальные случаи, соответствующие их требованиям.",
    TargetP3:
      "Инновации и разработки: инвестиции в исследования и разработки для создания новых металлургических корпусов и продуктов. Соблюдение опубликованных рабочих процедур, мер по снижению воздействия на окружающую среду и экологических стандартов.",
    // About Company end

    // Blog start
    BlogButton: "Более",
    BlogSpan: 'Блоги будут добавлены в ближайшее время',
    // Blog end

    // Contact start
    ContactPageH3: "Контакт",
    ContactPageP:
      "Напишите нам сообщение в любое время. Наши операторы свяжутся с вами в ближайшее время",
    ContactPageInput: "Ваше имя",
    ContactPageInput2: "Ваш номер телефона",
    ContactPageInput3: "Сообщение",
    ContactPageButton: "Отправка",
    ConatctPageH4: "Информация",
    ContactPageH6: "Хасанбой т: Бывший завод Ширибом, Промзона",
    // Contact end
    //Catalog id 
    catalogoption: 'Все продукты',
    //Calculyator
    CalcH2: "Калькулятор",


      //Basket
    BasketH1: 'Корзинка',
    BasketButton: 'Удалить все',
    BasketP1: 'сум',
    BasketSpanDiv: 'сум',
    BasketSpan1: 'сум',
    BasketSpan2: 'Итоговая цена :',
    BasketSpanA: 'Обработка заказа',
    BasketDivA: 'Товар недоступен',

        //Basket Submit
        BasketInput1: 'Введите полное имя',
        BasketInput2: '+998( )',
        BasketButton2: 'Отправка',

        BasketDivSpan: 'Товар недоступен',

      
           //Calc input select 
           //dvuxtavr
           CalcInput1: 'Выберите категорию',
           CalcInput2: 'Выберите тип',
           CalcInput3: 'Вес в 1м (кг)',
           CalcInput4: 'Длина в 1 тонне (м)',
           CalcInput5: 'Введите длину',
           CalcInput6: 'Генеральная кража',

             //armatura
        CalcInput7: 'Введите категорию (номер)',
        CalcInput8: 'Вес в 1м (кг)',
        CalcInput9: 'Длина в 1 тонне (м)',
        CalcInput10: 'Введите длину',
        CalcInput11: 'Генеральная кража',

           //ugalok
           CalcInput12: 'Выберите категорию',
           CalcInput13: 'Выберите тип',
           CalcInput14: 'Вес в 1м (кг)',
           CalcInput15: 'Длина в 1 тонне (м)',
           CalcInput16: 'Введите длину',
           CalcInput17: 'Генеральная кража',

           //shveller
           CalcInput18: 'Введите категорию (номер)',
           CalcInput19: 'Вес в 1м (кг)',
           CalcInput20: 'Длина в 1 тонне (м)',
           CalcInput21: 'Введите длину',
           CalcInput22: 'Генеральная кража',

               // труба 
               CalcInput23: 'Выберите внешний диаметр',
               CalcInput24: 'Выберите толщину стенки',
               CalcInput25: 'Вес в 1м (кг)',
               CalcInput26: 'Длина в 1 тонне (м)',
               CalcInput27: 'Введите длину',
               CalcInput28: 'Генеральная кража',

                // list 
                CalcInput29: 'Введите категорию (номер)',
                CalcInput30: 'вес в (кг)',
                CalcInput31: 'длина в 1 тонне',
                CalcInput32: 'Введите длину',
                CalcInput33: 'Генеральная кража',

                // квадрат профил 
                CalcInput34: 'Выбрать категорию',
                CalcInput35: 'Турини тангланг',
                CalcInput36: '1м даги оғирлиги (кг)',
                CalcInput37: '1тоннадаги узунлиги (м)',
                CalcInput38: 'Узунликни киритинг',
                CalcInput39: 'Умумий ўгирлиги',

                //квадрат прут
                CalcInput40: 'Введите категорию (номер)',
                CalcInput41: 'Вес в 1м (кг)',
                CalcInput42: 'Длина в 1 тонне (м)',
                CalcInput43: 'Введите длину',
                CalcInput44: 'Генеральная кража',


                   //прут
                   CalcInput45: 'Введите категорию (номер)',
                   CalcInput46: 'Вес в 1м (кг)',
                   CalcInput47: 'Длина в 1 тонне (м)',
                   CalcInput48: 'Введите длину',
                   CalcInput49: 'Генеральная кража',

                  //  металл паласа
                  CalcInput50: 'Введите категорию (номер)',
                  CalcInput51: 'вес в (кг)',
                  CalcInput52: 'Длина в 1 тонне',
                  CalcInput53: 'Введите длину',
                  CalcInput54: 'Генеральная кража',

                      //  металл планка
                      CalcInput55: 'Введите категорию (номер)',
                      CalcInput56: 'вес в (кг)',
                      CalcInput57: 'Длина в 1 тонне',
                      CalcInput58: 'Введите длину',
                      CalcInput59: 'Генеральная кража',

  },
    }
  }))
  